* Made in an online compiler
IDENTIFICATION DIVISION.
PROGRAM-ID. Pyramid.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 HEIGHT  PIC 99.
01 I       PIC 99.
01 ROWS    PIC X(50).
01 J       PIC 99.

PROCEDURE DIVISION.
BEGIN.
  ACCEPT HEIGHT

  PERFORM VARYING I FROM 1 BY 1 UNTIL I > HEIGHT
    MOVE SPACES TO ROWS
    PERFORM VARYING J FROM 1 BY 1 UNTIL J > I
      MOVE "*" TO ROWS(J:1)
    END-PERFORM
    DISPLAY ROWS
  END-PERFORM

  STOP RUN.
